Ran Plan for project: `cluster` dir: `cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.network: Reading...
data.terraform_remote_state.network: Read complete after 1s
data.aws_eks_addon_version.coredns: Reading...
data.aws_eks_addon_version.kube_proxy: Reading...
data.aws_eks_addon_version.vpc_cni: Reading...
module.eks.data.aws_default_tags.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["app-tier"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["app-tier"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["app-tier"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=768688893088]
module.eks.module.eks_managed_node_group["app-tier"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["app-tier"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=768688893088]
module.eks.module.eks_managed_node_group["app-tier"].data.aws_caller_identity.current: Read complete after 0s [id=768688893088]
data.aws_eks_addon_version.coredns: Read complete after 0s [id=coredns]
data.aws_eks_addon_version.vpc_cni: Read complete after 0s [id=vpc-cni]
data.aws_eks_addon_version.kube_proxy: Read complete after 0s [id=kube-proxy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Creator"] will be created
+ resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Creator"
      + resource_id = (known after apply)
      + value       = "tanmay"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["Purpose"] will be created
+ resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Purpose"
      + resource_id = (known after apply)
      + value       = "Demo"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = "v1.10.1-eksbuild.4"
      + arn                  = (known after apply)
      + cluster_name         = "TestCluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all             = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = "v1.28.2-eksbuild.2"
      + arn                  = (known after apply)
      + cluster_name         = "TestCluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all             = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
+ resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "TestCluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags                 = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all             = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
    }

  # module.eks.aws_eks_cluster.this[0] will be created
+ resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "TestCluster"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all                  = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + version                   = "1.28"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-039be143098cd44f8",
              + "subnet-0d3059d198f774641",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all        = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "TestCluster"
      + path                  = "/"
      + tags                  = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all              = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.aws_security_group.cluster[0] will be created
+ resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group."
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "TestCluster"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all               = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + vpc_id                 = "vpc-062c57817892b0305"
    }

  # module.eks.aws_security_group.node[0] will be created
+ resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "TestCluster-node"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster-node"
          + "Purpose" = "Demo"
        }
      + tags_all               = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster-node"
          + "Purpose" = "Demo"
        }
      + vpc_id                 = "vpc-062c57817892b0305"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
+ resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
+ resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+ resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
+ resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_https"] will be created
+ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
+ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
+ resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
+ resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
+ resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+ resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+ resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+ resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+ resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_eks_node_group.this[0] will be created
+ resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "TestCluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "r5a.xlarge",
        ]
      + labels                 = {
          + "Environment" = "TestCluster"
          + "tier"        = "app"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "app-tier-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-039be143098cd44f8",
          + "subnet-0d3059d198f774641",
        ]
      + tags                   = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + tags_all               = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + version                = "1.28"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 10
          + min_size     = 0
        }

      + timeouts {}
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_iam_role.this[0] will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "EKS managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "app-tier-eks-node-group-"
      + path                  = "/"
      + tags                  = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + tags_all              = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_iam_role_policy_attachment.this["arn:aws:iam::768688893088:policy/TestCluster-autoscaler"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::768688893088:policy/TestCluster-autoscaler"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+ resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["app-tier"].aws_launch_template.this[0] will be created
+ resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for app-tier EKS managed node group"
      + id                     = (known after apply)
      + key_name               = "TestCluster-worker"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "app-tier-"
      + tags                   = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + tags_all               = {
          + "Creator" = "tanmay"
          + "Name"    = "app-tier"
          + "Purpose" = "Demo"
          + "Tier"    = "app-tier"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + iops        = (known after apply)
              + throughput  = (known after apply)
              + volume_size = 40
              + volume_type = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Creator" = "tanmay"
              + "Name"    = "app-tier"
              + "Purpose" = "Demo"
              + "Tier"    = "app-tier"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Creator" = "tanmay"
              + "Name"    = "app-tier"
              + "Purpose" = "Demo"
              + "Tier"    = "app-tier"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Creator" = "tanmay"
              + "Name"    = "app-tier"
              + "Purpose" = "Demo"
              + "Tier"    = "app-tier"
            }
        }
    }

Plan: 32 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cluster
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=tanmay6414%252Fopeninnovationai%252Fcluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cluster
  ```
Plan: 32 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```